{
  "software": [
    {
      "name": "wikiMaps",
      "links": {"repo": "https://github.com/amaninders/mtProject", "demo": null},
      "tools": ["PostgreSQL", "Express", "Node.js"],
      "summaryImage": {"location": "/wikiMaps.png", "caption": "Collaborative mapping with wikiMaps app, currently centred in Dubai"},
      "summaryText": [
        "wikiMaps is a web app that allows users to collaboratively create and favourite maps, with each map having markers of their various icon types.",
        "For this collaborative project, I developed a PostgreSQL/Express-based REST API and contributed the HTML/CSS for the UI layout. This data was fed to the Google Maps JavaScript API to display the maps and markers. Git was used as the source control between collaborators."
      ]
    },
    {
      "name": "Tweeter",
      "links": {"repo": "https://github.com/calvin-xu0/tweeter", "demo": null},
      "tools": ["jQuery", "AJAX", "Node.js"],
      "summaryImage": {"location": "https://raw.githubusercontent.com/calvin-xu0/tweeter/master/docs/desktop-layout.png", "caption": "Desktop layout of Tweeter"},
      "summaryText": [
        "Tweeter is a single-page application intended to mimic a Twitter clone with responsive interaction. In addition to messaging, posted tweets acknowledge user input with shadows and a character counter serves as a reminder to keep messages concise."
      ]
    },
    {
      "name": "TinyApp",
      "links": {"repo": "https://github.com/calvin-xu0/tinyapp", "demo": null},
      "tools": ["Express", "Node.js"],
      "summaryImage": {"location": "https://raw.githubusercontent.com/calvin-xu0/tinyapp/master/docs/url-edit-page.png", "caption": "Details of a shortened link with a log of link visitors"},
      "summaryText": [
        "TinyApp is a link-shortening app offering similar features as services such as TinyURL. The Express server handles most functionality, and logging visitors provide potential analyatics capabilities."
      ]
    }

  ],

  "research": [
    {
      "application": "Energy",
      "researchTopic": "Fuel Cell Catalyst Longevity",
      "institution": "University of Waterloo",
      "group": {"name": "Applied Nanomaterials and Clean Energy Laboratory", "url": "http://chemeng.uwaterloo.ca/zchen"},
      "pi": "Dr. Zhongwei Chen",
      "summaryImage": {"location": "/electrocatalyst-orr.png", "caption": "ORR polarization curve of Pt-alloy w/ sulfur-doped graphene compared to commercial catalysts after accelerated testing. Adapted from C. Xu et al, DOI: 10.1039/c6ra19924k. © 2016 Royal Society of Chemistry"},
      "summaryText": [
        "Hydrogen fuel cells offer an avenue for emission-free energy generation via electrochemical reactions. Electrochemical energy generation boasts greater efficiencies than the hydrocarbon combustion processes widely used today, and the only product of the reaction is water.",
        "Polymer electrolyte membrane fuel cells (PEMFCs) are particularly attractive due to their relatively low operating temperatures. However, fuel cells currently rely on catalysts made of platinum supported by carbon black. Over time, these expensive catalysts degrade from continued use despite PEMFCs operating at cooler temperatures than other fuel cells.",
        "ANCEL had previously demonstrated the use of sulfur-doped graphene to mitigate this degradation for pure Pt crystals as compared to traditional carbon supports. While the crystal facets of pure Pt can be tailored for maximum effect, literature has also demonstrated that Pt-alloy nanoparticles provide high catalytic capabilities over Pt alone through phenomena such as lattice strain effects.",
        "My research focused on the previously unknown compatibility of sulfur-doped graphene supports with heterogenous Pt nanoparticles as well as the support's overal effects on catalytic performance and catalyst durability for practical long-term use."
      ],
      "publication": {"doi": "10.1039/c6ra19924k", "citation": "<mark>C. Xu</mark>, M. A. Hoque, G. Chiu, T. Sung, and Z. Chen, “Stabilization of platinum-nickel alloy nanoparticles with sulfur-doped graphene support in polymer electrolyte membrane fuel cells,” <cite>RSC Adv.</cite>, vol. 6, pp. 112226–112231, 2016."}
    },
    {
      "application": "Medicine",
      "researchTopic": "Medical Adhesives",
      "institution": "Harvard-MIT Health Sciences and Technology",
      "group": {"name": "Karp Lab", "url": "https://karplab.net"},
      "pi": "Dr. Jeffrey Karp",
      "summaryImage": {"location": "/adhesive-2.png", "caption": "(a) Polymerization and (b) single-emulsion fabrication schema for HLAA-based NanoGlue, with (c) dispersity distributions. From Y. Lee et al, DOI: 10.1002/adhm.201500419. © 2015 WILEY-VCH Verlag GmbH & Co. KGaA, Weinheim"},
      "summaryText": [
        "Surgical wound closure can be achieved through traditional tools such as staples and sutures, but surgical glues have huge advantages in practicality and post-surgery conditions. These adhesive glues are typically administered to sites using a variety of techniques.",
        "The Karp Lab conducted previous work in tissue-adhesive glues and patches, and techniques involving injectable adhesives provide means of wound closure where bulky alternatives are impractical. One challenge of this technique is the actual ease of injecting a robust adhesive through a small-bore needle.",
        "I worked closely with Dr. Yuhan Lee (currently Instructor of Medicine at Harvard Medical School) where his postdoctoral research at the lab involved the ability to easily administer a pre-cured adhesive solution through needles and trocars yet still form a glue with strong adhesive properties after curing in surgical sites.",
        "My research contributions in this topic focused on the materials characterization of polymer candidates such as PGSA to understand the change in pre- and post-curing properties of the desired medical adhesive."
      ],
      "publication": {"doi": "10.1002/adhm.201500419", "citation": "Y. Lee, C. Xu, M. Sebastin, A. Lee, N. Holwell, <mark>C. Xu</mark>, D. Miranda Nieves, L. Mu, R. S. Langer, C. Lin, and J. M. Karp, “Bioinspired Nanoparticulate Medical Glues for Minimally Invasive Tissue Repair,” <cite>Adv. Healthc. Mater.</cite>, vol. 4, no. 16, pp. 2587–2596, 2015."}
    }
  ]
}